Revit 2026 API
Element.ChangeTypeId Method
Overload List
Name | Description
ChangeTypeId(ElementId) |  Changes the type of the element.
ChangeTypeId(Document, ICollection<ElementId>, ElementId)
Top
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace